src/Documents/ProductsPricePlan/ProductsPricePlan.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductsPricePlan</name>
  <registerRecords>InformationRegister.PriceHistory</registerRecords>
  <attributes>
    <name>ValidDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/PriceHistory/PriceHistory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PriceHistory</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Product</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ProductsPricePlan/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	//{{__REGISTER_REGISTERRECORDS_WIZARD
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.

	// register PriceHistory
	RegisterRecords.PriceHistory.Write = True;
	For Each CurRowProducts In Products Do
		Record = RegisterRecords.PriceHistory.Add();
		Record.Product = CurRowProducts.Product;
		Record.Period = ValidDate;
		Record.Price = CurRowProducts.Price;
	EndDo;

	//}}__REGISTER_REGISTERRECORDS_WIZARD
EndProcedure
